tsung/load_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="tsung.kqsu4hptxs.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    
    </arrivalphase>
    
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
   <arrivalphase phase="4" duration="10" unit="second">
     <users arrivalrate="8" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="10" unit="second">
     <users arrivalrate="16" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="32" unit="second"></users>
   </arrivalphase>

   <!--
   <arrivalphase phase="7" duration="30" unit="second">
     <users arrivalrate="64" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="8" duration="30" unit="second">
     <users arrivalrate="128" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="9" duration="30" unit="second">
     <users arrivalrate="256" unit="second"></users>
   </arrivalphase>
    -->

  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <!-- flow 1: bidding users-->
    <session name="flow_1" probability="20" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>
      
      <thinktime value="1" random="true"></thinktime>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="nth_browsing_user" />
      </setdynvars>

      <thinktime value="2" random="true"></thinktime>

      <request subst="true" >
        <dyn_variable name="user_id_1" re="[Ll]ocation: http://.*/users/(.*)\r" />
        <http url='/users/sign_in' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_nth_browsing_user%%_broswer@ucsb&amp;user[password]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <!-- bid a random item -->
      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <setdynvars sourcetype="random_number" start="1" end="38000">
        <var name="random_item" />
      </setdynvars>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/%%_random_item%%' version='1.1' method='GET'></http>
      </request>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="10" end="1200">
          <var name="bid_price" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <http url='/bid_items/%%_random_item%%/bid_records' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;bid_record[price]=%%_bid_price%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>
      </if>

      <!-- bid another item -->
      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <setdynvars sourcetype="random_number" start="1" end="38000">
        <var name="random_item2" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/%%_random_item2%%' version='1.1' method='GET'></http>
      </request>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="10" end="1200">
          <var name="bid_price2" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <http url='/bid_items/%%_random_item2%%/bid_records' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;bid_record[price]=%%_bid_price2%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>
      </if>
      
      <!-- search something -->
      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/searches/new' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="10" end="1200">
          <var name="random_community" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <dyn_variable name="search_item" xpath="/html/body/div[2]/div/div/div/table/tbody/tr[1]/td[1]/a/@href">
          <http url='/searches' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;search[category_id]=%%_random_community%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true">
        <http url='%%_search_item%%' version='1.1' method='GET'></http>
      </request>
      
      </if>
    </session>

    <!-- ############################################################ -->
    <!-- flow 2, bidding user -->
    <session name="flow_2" probability="30" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <thinktime value="1" random="true"></thinktime>

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      

      <thinktime value="1" random="true"></thinktime>

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="49">
        <var name="nth_broswe_user" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request subst="true" >
        <dyn_variable name="user_id" re="[Ll]ocation: http://.*/users/(.*)\r" />
        <http url='/users/sign_in' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_nth_broswe_user%%_broswer@ucsb&amp;user[password]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      

      <!-- go to bid second item -->
      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="38000">
        <var name="nth_item2" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/%%_nth_item2%%' version='1.1' method='GET'></http>
      </request>

      <if var="authenticity_token" neq="">
        <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
        </setdynvars>
        <setdynvars sourcetype="random_number" start="10" end="1200">
          <var name="bid_price" />
        </setdynvars>

        <thinktime value="1" random="true"></thinktime>

        <request subst="true" >
          <http url='/bid_items/%%_nth_item2%%/bid_records' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;bid_record[price]=%%_bid_price%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
        </request>
      </if>

      <!-- check the bidded items -->
      <request subst="true">
        <http url='/bid_items/%%_nth_item%%' version='1.1' method='GET'></http>
      </request>

      <request subst="true">
        <http url='/bid_items/%%_nth_item2%%' version='1.1' method='GET'></http>
      </request>

    </session>

    <!-- ############################################################ -->
    <!-- flow 3, new users -->
    <session name="flow_3" probability="5" type="ts_http">
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/users/sign_in' version='1.1' method='GET'></http>
      </request>

      <!-- go to sign up page -->
      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign_up' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_string" length="5">
        <var name="user_email" />
      </setdynvars>

      <thinktime value="2" random="true"></thinktime>

      <request subst="true" >
        <!-- <dyn_variable name="new_user_id" re="[Ll]ocation: http://.*/users/(.*)\r" /> -->
        <http url='/users' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_user_email%%@ucsb&amp;user[password]=123456&amp;user[password_confirmation]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- go to join one community -->
      <request>
        <http url='/users/communities' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="nth_community" />
      </setdynvars>

      <thinktime value="1" random="true"></thinktime>

      <request>
        <http url='/users/communities/%%_nth_community' version='1.1' method='GET'></http>
      </request>

      <!-- how to join -->

    </session>

    <session name="flow_1" probability="50" type="ts_http">
      <!-- post first item -->
      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/new' version='1.1' method='GET'></http>
      </request>
      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <thinktime value="2" random="true"></thinktime>

      <setdynvars sourcetype="random_string" length="10">
        <var name="rndname1" />
      </setdynvars>

      <request subst="true" >
        <dyn_variable name="item_id_1_1" re="[Ll]ocation: http://.*/bid_items/(.*)\r" />
        <http url="/bid_items" version="1.1" contents="authenticity_token=%%_authenticity_token%%&amp;bid_item[item_name]=%%_rndname1%%&amp;bid_item[starting_price]=10&amp;bid_item[fixed_price]=2000" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- post second item -->
      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/new' version='1.1' method='GET'></http>
      </request>
      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <thinktime value="2" random="true"></thinktime>

      <setdynvars sourcetype="random_string" length="10">
        <var name="rndname2" />
      </setdynvars>

      <request subst="true" >
        <dyn_variable name="item_id_1_2" re="[Ll]ocation: http://.*/bid_items/(.*)\r" />
        <http url="/bid_items" version="1.1" contents="authenticity_token=%%_authenticity_token%%&amp;bid_item[item_name]=%%_rndname2%%" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <!-- check the posted items -->
      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/bid_items/%%_item_id_1_1%%' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/bid_items' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/bid_items/%%_item_id_1_2%%' version='1.1' method='GET'></http>
      </request>

      <!-- check profile -->
      <request>
        <dyn_variable name="item_1" xpath="//div[1]/table/tbody/tr[1]/td/a"/>
        <dyn_variable name="item_2" xpath="//div[1]/table/tbody/tr[2]/td/a"/>
        <dyn_variable name="item_3" xpath="//div[1]/table/tbody/tr[3]/td/a"/>
        <http url='/profile' version='1.1' method='GET'></http>
      </request>

      <!-- check items -->
      <request>
        <http url='%%_item_1%%' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='%%_item_2%%' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='%%_item_3%%' version='1.1' method='GET'></http>
      </request>

    </session>

    <!-- ############################################################ -->


  </sessions>
</tsung>